Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/index.html.txt.tmx
Source language: en
Languages: ga

source: This document describes the established Leaving Certificate programme
ga: Tá cur síos anseo ar an Ardteistiméireacht Bhunaithe

source: Leaving Certificate examination fees
ga: Táillí scrúdaithe na hArdteistiméireachta

source: Students taking the State Leaving Certificate examinations must pay examination fees
ga: Ní mór do dhaltaí atá ag déanamh na hArdteistiméireachta táillí a íoc

source: Information on fees and exemptions from them
ga: Eolas maidir le táillí agus maidir leo siúd atá díolmhaithe uathu

source: The Leaving Certificate Applied is a two-year, self-contained programme aimed at recognising the talents of all students and providing opportunities to prepare for working and adult life
ga: Cur síos ar an Ardteistiméireacht Fheidhmeach

source: Ireland's Leaving Certificate Vocational Programme (LCVP) is a senior cycle programme designed to give a strong vocational dimension to the Established Leaving Certificate
ga: Cur síos ar Ghairmchlár na hArdteistiméireachta

source: The Junior Certificate examination is held at the end of the three-year Junior Cycle in second-level schools
ga: Cur síos ar Chlár an Teastais Shóisearaigh

source: State examination arrangements for children with disabilities
ga: Socruithe scrúdaithe do scoláirí faoi mhíchumas

source: Special arrangements are in place for children with disabilities who are taking State examinations
ga: Tá socruithe speisialta i bhfeidhm do leanaí le míchumas a bhfuil scrúduithe Stáit á ndéanamh acu

source: Appealing the Leaving Certificate results
ga: Achomharc a dhéanamh in aghaidh torthaí na hArdteistiméireachta

source: Describes the procedures to follow if you wish to appeal the results of your Leaving Certificate examinations
ga: Conas achomharc a dhéanamh in aghaidh do thorthaí i scrúdú na hArdteistiméireachta

source: The State Examinations Commission
ga: Coimisiún na Scrúduithe Stáit

source: Describes the work of the State Examinations Commission
ga: Cur síos ar obair Choimisiún na Scrúduithe Stáit

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
